/**
  ******************************************************************************
  * @file    data_convert.c
  * @author  fire
  * @version V1.0
  * @date    2015-xx-xx
  * @brief   can驱动
  ******************************************************************************
  * @attention
  *
  * 实验平台:野火  STM32 F103-霸道 开发板  
  * 论坛    :http://www.firebbs.cn
  * 淘宝    :https://fire-stm32.taobao.com
  *
  ******************************************************************************
  */ 

#include "./converter/data_math.h"
//#include "./usart/bsp_usart.h"
#include <stdio.h>
#include "string.h"
#include <stdlib.h>


/*
*********************************************************************************************************
*	函 数 名: power
*	功能说明: 求n的k次方
*	形    参：n底  k次方
*	返 回 值: 
*********************************************************************************************************
*/
int32_t power(int32_t n,int8_t k){

	if(k<=0)return 1;
	else{
	
	return n*power(n,k-1);
	}


}




/**************************END OF FILE************************************/











